TestPlans/Home/Home Protect/xml/HPT3_25112014_7.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tem="http://tempuri.org/" xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd">
  <soap:Body>
    <tem:GetQuote>
      <tem:userName>Compare the Market</tem:userName>
      <tem:passWord>1254CTM2014</tem:passWord>
      <tem:quotationDataXml>&lt;web:QuestionData xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;web:TitleID&gt;003&lt;/web:TitleID&gt;
  &lt;web:FirstName&gt;Gerald&lt;/web:FirstName&gt;
  &lt;web:LastName&gt;Seven&lt;/web:LastName&gt;
  &lt;web:DateOfBirth&gt;1966-04-17&lt;/web:DateOfBirth&gt;
  &lt;web:Sex&gt;M&lt;/web:Sex&gt;
  &lt;web:MaritalStatusID originalvalueid="Separated"&gt;1&lt;/web:MaritalStatusID&gt;
  &lt;web:OccupationID originalvalueid="Retired"&gt;R09&lt;/web:OccupationID&gt;
  &lt;web:BusinessID originalvalueid="Retired"&gt;186&lt;/web:BusinessID&gt;
  &lt;web:Email&gt;michael.hudson@emailreaction.org&lt;/web:Email&gt;
  &lt;web:DaytimeTelephoneNumber&gt;01778 852852&lt;/web:DaytimeTelephoneNumber&gt;
  &lt;web:HouseNumber&gt;10&lt;/web:HouseNumber&gt;
  &lt;web:Street1&gt;Brambridge&lt;/web:Street1&gt;
  &lt;web:Street2 /&gt;
  &lt;web:TownCity&gt;Eastleigh&lt;/web:TownCity&gt;
  &lt;web:County&gt;Hampshire&lt;/web:County&gt;
  &lt;web:Postcode&gt;SO50 6HZ&lt;/web:Postcode&gt;
  &lt;web:IsSameAsRiskAddress&gt;1&lt;/web:IsSameAsRiskAddress&gt;
  &lt;web:PropertyHouseNumber&gt;10&lt;/web:PropertyHouseNumber&gt;
  &lt;web:PropertyStreet1&gt;Brambridge&lt;/web:PropertyStreet1&gt;
  &lt;web:PropertyStreet2 /&gt;
  &lt;web:PropertyTownCity&gt;Eastleigh&lt;/web:PropertyTownCity&gt;
  &lt;web:PropertyCounty&gt;Hampshire&lt;/web:PropertyCounty&gt;
  &lt;web:PropertyPostcode&gt;SO50 6HZ&lt;/web:PropertyPostcode&gt;
  &lt;web:IsJointApplicant&gt;1&lt;/web:IsJointApplicant&gt;
  &lt;web:SoleOccupancy originalvalueid="Students"&gt;0&lt;/web:SoleOccupancy&gt;
  &lt;web:WhoElseLives originalvalueid="Students"&gt;STU01&lt;/web:WhoElseLives&gt;
  &lt;web:HaveConvictions&gt;0&lt;/web:HaveConvictions&gt;
  &lt;web:BankruptOrCCJOrIVA&gt;0&lt;/web:BankruptOrCCJOrIVA&gt;
  &lt;web:RefusedCancelled&gt;0&lt;/web:RefusedCancelled&gt;
  &lt;web:JointPolicyHolder&gt;
    &lt;web:JPTitleID&gt;003&lt;/web:JPTitleID&gt;
    &lt;web:JPFirstName&gt;Joint&lt;/web:JPFirstName&gt;
    &lt;web:JPLastName&gt;Policyholder&lt;/web:JPLastName&gt;
    &lt;web:JPDateOfBirth&gt;1960-01-01&lt;/web:JPDateOfBirth&gt;
    &lt;web:JPSex&gt;M&lt;/web:JPSex&gt;
    &lt;web:JPRelationshipID originalvalueid="Other Family"&gt;5&lt;/web:JPRelationshipID&gt;
    &lt;web:JPOccupationID originalvalueid="Not employed due to disability"&gt;U03&lt;/web:JPOccupationID&gt;
    &lt;web:JPBusinessID originalvalueid="Not employed due to disability"&gt;186&lt;/web:JPBusinessID&gt;
  &lt;/web:JointPolicyHolder&gt;
  &lt;web:PreviouslyBoughtHomeInsurance&gt;0&lt;/web:PreviouslyBoughtHomeInsurance&gt;
  &lt;web:StartDate&gt;2014-10-30&lt;/web:StartDate&gt;
  &lt;web:CoverTypeID originalvalueid="Buildings &amp;amp; Contents Cover"&gt;1&lt;/web:CoverTypeID&gt;
  &lt;web:NumberOfYearsInsuranceHeld originalvalueid="no previous insurance"&gt;N&lt;/web:NumberOfYearsInsuranceHeld&gt;
  &lt;web:PreviousClaims&gt;1&lt;/web:PreviousClaims&gt;
  &lt;web:Claim xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:ClaimDate&gt;2010-01-01&lt;/web:ClaimDate&gt;
    &lt;web:ClaimAmount&gt;1000&lt;/web:ClaimAmount&gt;
    &lt;web:ClaimTypeID originalvalueid="malicious damage/vandalism"&gt;XB&lt;/web:ClaimTypeID&gt;
    &lt;web:ClaimSection&gt;3&lt;/web:ClaimSection&gt;
    &lt;web:ClaimAtCurrentProperty&gt;0&lt;/web:ClaimAtCurrentProperty&gt;
  &lt;/web:Claim&gt;
  &lt;web:HRI xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:HRICategoryID originalvalueid="musical instruments"&gt;Z99&lt;/web:HRICategoryID&gt;
    &lt;web:HRIDescription&gt;Trumpet&lt;/web:HRIDescription&gt;
    &lt;web:HRIValue&gt;2100&lt;/web:HRIValue&gt;
  &lt;/web:HRI&gt;
  &lt;web:PropertyTypeID originalvalueid="Flat - other floor"&gt;48&lt;/web:PropertyTypeID&gt;
  &lt;web:YearBuilt&gt;1986&lt;/web:YearBuilt&gt;
  &lt;web:Bedrooms originalvalueid="Six"&gt;6&lt;/web:Bedrooms&gt;
  &lt;web:WallConstructionID originalvalueid="Prefabricated - non-combustible"&gt;14&lt;/web:WallConstructionID&gt;
  &lt;web:RoofConstructionID originalvalueid="Other"&gt;AGG99&lt;/web:RoofConstructionID&gt;
  &lt;web:Roof33PercentFlat&gt;0&lt;/web:Roof33PercentFlat&gt;
  &lt;web:RoofThatched&gt;0&lt;/web:RoofThatched&gt;
  &lt;web:PropertyListed&gt;0&lt;/web:PropertyListed&gt;
  &lt;web:SignsOfSubsidence&gt;0&lt;/web:SignsOfSubsidence&gt;
  &lt;web:IssueRectified&gt;1&lt;/web:IssueRectified&gt;
  &lt;web:underpinned&gt;0&lt;/web:underpinned&gt;
  &lt;web:GoodStateOfRepair&gt;0&lt;/web:GoodStateOfRepair&gt;
  &lt;web:WhyNot&gt;DER01&lt;/web:WhyNot&gt;
  &lt;web:OwnershipTypeID originalvalueid="Supplied by Employer – Furnished"&gt;RPL01&lt;/web:OwnershipTypeID&gt;
  &lt;web:OccupiedWhenID originalvalueid="Occupied Day and Night"&gt;OCC03&lt;/web:OccupiedWhenID&gt;
  &lt;web:ConsecutiveDaysUnoccupiedID originalvalueid="Up to 45"&gt;30&lt;/web:ConsecutiveDaysUnoccupiedID&gt;
  &lt;web:DomesticUseOnly originalvalueid="No business or professional use"&gt;1&lt;/web:DomesticUseOnly&gt;
  &lt;web:PropertyUseType&gt;HOL01&lt;/web:PropertyUseType&gt;
  &lt;web:PropertySelfContainedWithLockableEntrances&gt;1&lt;/web:PropertySelfContainedWithLockableEntrances&gt;
  &lt;web:MainLocksID originalvalueid="UPVC or aluminium door with multi-point locking system"&gt;3&lt;/web:MainLocksID&gt;
  &lt;web:PatioLocksID originalvalueid="Other lock type"&gt;99&lt;/web:PatioLocksID&gt;
  &lt;web:OtherLocksID originalvalueid="No other external doors"&gt;5&lt;/web:OtherLocksID&gt;
  &lt;web:KeyOperatedWindows&gt;1&lt;/web:KeyOperatedWindows&gt;
  &lt;web:BurglarAlarm&gt;0&lt;/web:BurglarAlarm&gt;
  &lt;web:NACOSSApproved&gt;0&lt;/web:NACOSSApproved&gt;
  &lt;web:Safe&gt;1&lt;/web:Safe&gt;
  &lt;web:SmokeAlarm&gt;1&lt;/web:SmokeAlarm&gt;
  &lt;web:Within200mWater&gt;0&lt;/web:Within200mWater&gt;
  &lt;web:BuildingsSumInsured&gt;100000&lt;/web:BuildingsSumInsured&gt;
  &lt;web:BuildingsAccidentalDamage&gt;0&lt;/web:BuildingsAccidentalDamage&gt;
  &lt;web:BuildingsVolExcess originalvalueid="100"&gt;100&lt;/web:BuildingsVolExcess&gt;
  &lt;web:ContentsSumInsured&gt;40000&lt;/web:ContentsSumInsured&gt;
  &lt;web:ContentsAccidentalDamage&gt;0&lt;/web:ContentsAccidentalDamage&gt;
  &lt;web:ContentsVolExcess originalvalueid="100"&gt;100&lt;/web:ContentsVolExcess&gt;
&lt;/web:QuestionData&gt;</tem:quotationDataXml>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>